{
  "id": "faction-bregan-daerthe",
  "slug": "bregan-daerthe",
  "name": "Bregan D'aerthe",
  "type": "FACTION",
  "category": "The Shadow Brokers",
  "cityId": "karnuk",
  "region": "underdark",
  "factionId": "bregan-daerthe",
  "summary": "Officially neutral. Practically indispensable. Chaos is their product.",
  "tags": ["faction", "karnuk", "underdark"],
  "publishedAt": "2026-02-25T00:00:00.000Z",
  "source": "Lore Import",
  "content": "> *\"We don't pick sides. We make sure there are always sides to pick.\"*\n\n## Overview\n\nBregan D'aerthe doesn't control Karnuk. They just make sure nobody else can either. Jevan Alderleaf sells intelligence to all five families — never enough to end any conflict, always enough to keep everyone at the table and spending. The Jarlaxle Doctrine is simple: a city at war with itself makes them rich. A city destroyed makes them homeless. When Bregan is in the room, everybody's winning except the people who think they're winning.\n\nBregan D'aerthe is **Drow** — Jarlaxle's Company, stationed in the Neutral Quarter and operating through the elegant machinery of controlled chaos.\n\n## Leadership\n\n| Name | Role | Age |\n|------|------|-----|\n| Captain Jevan Alderleaf | Karnuk Commander | 187 years |\n| Lieutenant Veyran Veyth | Field Operations | 201 years |\n| Master Scout Talvrae Darkwhisper | Intelligence Chief | 245 years |\n| Kethris \"The Diplomat\" | Enforcer | 134 years |\n\n**Captain Jevan Alderleaf** — Slim drow in clothing that shifts between guild colors depending on who he's meeting. Silver hair in complex braids. Wears rings from all five families — gifts or trophies, he won't say. Has never drawn his rapier in public. Speaks in riddles. Treats violence as vulgar but necessary.\n\n**Lieutenant Veyran Veyth** — Nondescript drow, master of disguise, face you forget immediately. Unusually kind to operatives. Believes in developing long-term assets rather than burning disposable ones.\n\n**Master Scout Talvrae Darkwhisper** — Paranoid, brilliant, never leaves the Bregan safehouse. Runs an informant network inside all five families simultaneously. Knows Karnuk's secrets before their own leadership does.\n\n**Kethris \"The Diplomat\"** — Massive drow, 6'4\", heavily scarred, missing one eye. Wears diplomat's robes over armor. Polite, apologetic, brutally efficient. \"I'm very sorry about this. But you've left me no choice.\"\n\n## Culture & Code\n\nThe Bregan Obsidian Coin is proof of membership. Code phrases change weekly. The Accounting — monthly intelligence reports — is mandatory. Blood Debt is absolute: if a Bregan member is killed, the organization takes vengeance. Always. The Unmarking erases failed agents from Bregan's records and memory entirely.\n\n## Relationships\n\n- **All Five Families** · Controlled tension — Sells information to everyone. Ensures no one achieves total dominance. Profitable instability is the product.\n- **Brotherhood of the Forge** · Dangerous respect — Three Bregan agents dead. Azrael's doing. Jevan hasn't responded because he hasn't figured out how to respond to elegance with elegance yet.\n- **Steel Syndicate** · Feeding rope — Kethar thinks Bregan is working for him. Jevan finds this charming.\n\n## Active Threat\n\nJevan's delicate balance is being undermined by Garruk Bloodaxe feeding resources to Steel Syndicate. Jevan doesn't know Bloodaxe is the source. His balancing act is working on false information."
}
