{
  "id": "faction-deepstone-miners",
  "slug": "deepstone-miners",
  "name": "Deepstone Miners",
  "type": "FACTION",
  "category": "The Muscle",
  "cityId": "karnuk",
  "region": "underdark",
  "factionId": "deepstone-miners",
  "summary": "They run the docks, control all labor, and know the city stops breathing without them.",
  "tags": ["faction", "karnuk", "underdark"],
  "publishedAt": "2026-02-25T00:00:00.000Z",
  "source": "Lore Import",
  "content": "> *\"You don't move a crate in Karnuk without our say-so.\"*\n\n## Overview\n\nTwenty-three piers. Forty-three warehouses. Every barge, every ferry, every skiff of cargo that touches Karnuk passes through Grommash Stonefist's hands. He didn't build this city. He built what makes it run. The other families can argue about prestige and politics all they want — the Miners decide whether those arguments get fed.\n\nThe Deepstone Miners are **Hobgoblins** with iron-gray skin and the organized ferocity of a military operation that just happens to also run a union. Control the docks, control the city's commercial lifeblood.\n\n## Leadership\n\n| Name | Role | Age |\n|------|------|-----|\n| Don Grommash Stonefist | Boss | 52 years |\n| \"Mother\" Vrekka Stonefist | Logistics Chief | 48 years |\n| Throk \"The Hook\" | Dockside Capo | 35 years |\n| The Breakers | Enforcer Squad | Various |\n\n**Don Grommash Stonefist** — Massive hobgoblin with iron-gray skin and a jaw like an anvil. Steel gauntlets reportedly fused to his fists. Missing his right ear from a tavern fight he won anyway. Direct, loud, and surprisingly fair.\n\n**\"Mother\" Vrekka Stonefist** — The real brains of the operation. Oil-stained leathers, always smoking a pipe. Runs a competing information network that makes Bregan D'aerthe quietly uncomfortable. Her methodology: \"We don't threaten. We just stop loading your shipments. Permanently.\"\n\n**Throk \"The Hook\"** — Jovial giant who laughs while cracking skulls. Carries a longshoreman's cargo hook as his primary weapon. Coordinates all smuggling through the lower docks.\n\n**The Breakers** — Six-man squad: Skarn, Drokka, Vesh, Morgul, Thrax, Rekka. Dock-brawl veterans who specialize in workplace accidents.\n\n## Culture & Code\n\nThe Stonefist Salute — fist to heart, then forehead — is used among all dock workers regardless of family affiliation. Monthly union meetings at Grinder's Rest are mandatory and treated as sacred. Grommash pays the guild dues of orphaned miners' children personally.\n\n## Relationships\n\n- **Steel Syndicate** · Escalating conflict — Warehouse 7 is the flashpoint. Syndicate mechs threatening dock workers.\n- **Bregan D'aerthe** · Business arrangement — Uneasy truce between Mother Vrekka's intel network and Jevan's. Dock access granted in exchange for information.\n- **Iron Hammer Clan** · Grudging respect — Both old-guard. Different methods. Grommash respects Thorgar's code even if he thinks it's obsolete.\n\n## Active Threat\n\nSteel Syndicate mechs are encroaching on dock operations. Warehouse 7 is actively contested — both families have operatives inside. Mother Vrekka is planning counter-operations. Grommash doesn't know his nephew Krev is on the Syndicate payroll."
}
