{
  "id": "faction-steel-syndicate",
  "slug": "steel-syndicate",
  "name": "Steel Syndicate",
  "type": "FACTION",
  "category": "The New Blood",
  "cityId": "karnuk",
  "region": "underdark",
  "factionId": "steel-syndicate",
  "summary": "34 years old. Already winning. Making enemies faster than allies. Doesn't care.",
  "tags": ["faction", "karnuk", "underdark"],
  "publishedAt": "2026-02-25T00:00:00.000Z",
  "source": "Lore Import",
  "content": "> *\"The future belongs to those who build it.\"*\n\n## Overview\n\nKethar Steelheart killed the previous Steel Syndicate boss in a coup at age 28. He lost his right tusk in the fight. He replaced his left arm with a mechanical prosthetic he designed himself. The missing tusk and the mechanical arm are not accidents — they are statements. This is a man who will discard any part of himself that isn't useful and replace it with something better. The old families call him dangerous. They're right, but they're missing the more important point: he's also right.\n\nThe Syndicate is **Bugbears** — massive, brutal, and in Kethar's hands, terrifyingly innovative. They control the Syndicate Spire and run at full operations twenty-four hours a day.\n\n## Leadership\n\n| Name | Role | Age |\n|------|------|-----|\n| Don Kethar Steelheart | Boss | 34 years |\n| Veysha \"Geargrind\" | R&D Chief | 41 years |\n| Thrak \"Ironjaw\" | Muscle Capo | 28 years |\n| Shadow Advisor | Planted Agent | Unknown |\n\n**Don Kethar Steelheart** — Missing right tusk from the coup that elevated him. Left arm is a mechanical prosthetic, custom-built. Wears armor with riveted plates and visible gears — not for function, for message. Obsessed with war-mechs. Ruthless, innovative, impatient.\n\n**Veysha \"Geargrind\"** — Bugbear female covered in burn scars. Missing several fingers, replaced with tools. Genuine mad scientist energy — giggles when experiments fail, takes notes, tries again. Loyal to innovation before Kethar.\n\n**Thrak \"Ironjaw\"** — Lost his original jaw to acid in a territorial dispute. The replacement is solid iron. Loves violence with the uncomplicated enthusiasm of someone who is very, very good at it.\n\n**Shadow Advisor** — Shadowed Parliament asset feeding resources and intelligence to Kethar. Neither Kethar nor the Parliament fully grasps the other's complete game. This will matter.\n\n## Culture & Code\n\nThe Spark headquarters runs all hours, music playing, arc-lights blazing. No reverence for tradition. No patience for process. If it works, keep it. If it doesn't, burn it and try the next version.\n\n## Relationships\n\n- **Iron Hammer Clan** · Systematic acquisition — Buying their properties below value. Patience is the weapon.\n- **Deepstone Miners** · Escalating conflict — Warehouse 7 is the current flashpoint. Syndicate mechs directly threatening Deepstone dock operations.\n- **Bregan D'aerthe** · Kethar thinks he's using them — Jevan is feeding him rope. Kethar thinks it's a gift.\n\n## Active Threat\n\nAggressive buyouts of Ironhammer properties. Warehouse 7 standoff with Deepstone. Recruiting Brotherhood artisans. Has unknown Parliament backing that is not a gift — it is a leash he doesn't know he's wearing."
}
