{
  "id": "location-abyssal-spire",
  "slug": "abyssal-spire",
  "name": "Abyssal Spire",
  "type": "LOCATION",
  "category": "Surface Diplomatic Citadel",
  "summary": "Where the surface world and the Underdark negotiate — a city of towers above and tunnels below, built on the premise that cooperation is preferable to the alternative.",
  "content": "The towers of Abyssal Spire pierce the sky above what used to be the most important harbor city in Faerûn. Below them, cut into the bedrock over fifty years of labor, tunnels connect the city's foundations directly to Underdark settlements twenty miles in every direction. The city was designed to be a bridge. Whether it is a bridge or a bottleneck depends on who you ask and what they're trying to move.\n\nDiplomats come to Abyssal Spire because it's the only place in the known world where a surface ambassador and an Underdark envoy can meet on nominally neutral ground without either side needing to make a statement about it. The city's founding charter, drafted by people who understood that symbolism has to be explicit or it doesn't work, declares the city sovereign and independent of both surface kingdoms and Underdark powers. This declaration is respected in the same way that most declarations are respected — completely, until it isn't, and then violently.\n\n## The Convergence District\n\nAt the city's heart lies the Convergence — a massive structure that serves simultaneously as embassy quarter, market hall, neutral meeting ground, and the most extensively monitored space in the northern hemisphere. Conversations in the Convergence are understood by all parties to be heard. The etiquette has evolved accordingly: nothing said in the Convergence is candid, and nothing meant is said. Real negotiations happen in the tunnels.\n\n## The Price of Neutrality\n\nAbyssal Spire is expensive to maintain in every sense. The diplomatic staff, the security apparatus, the infrastructure connecting surface and deep — all of it runs on contributions from parties who have a vested interest in keeping the negotiation space open. This means that Abyssal Spire is always in debt to someone, and always carefully making sure that it is in debt to enough people simultaneously that no one creditor can afford to call in what they're owed.",
  "region": "surface",
  "tags": [
    "location",
    "surface",
    "diplomatic",
    "hidden"
  ],
  "hidden": true,
  "publishedAt": "2026-02-27T00:00:00.000Z",
  "source": "Lore Import",
  "imageUrl": "https://raw.githubusercontent.com/GamerDad29/mythos-vault/main/images/location-abyssal-spire.jpg"
}