{
  "id": "location-phoenixs-respite",
  "slug": "phoenixs-respite",
  "name": "Phoenix's Respite",
  "type": "LOCATION",
  "category": "Surface Fortified City",
  "summary": "A city that burned and rebuilt itself into something harder — now the surface world's primary line of supply for the Underdark's defense.",
  "content": "Phoenix's Respite burned. That's not a metaphor or a legend — it is a historical fact that every resident can tell you with the particular specificity that comes from being very close to something very bad. The calamity that leveled the old city has different names depending on who's telling it and what they want you to understand about it, but the result is universal: a generation ago, this was rubble. Now it's the most fortified city on the northern coast, and the people who rebuilt it are justifiably proud and justifiably paranoid about losing it again.\n\nThe rebuilding was done right, which is to say it was done with more money and foresight than most disasters generate. The city's new walls are enchanted — not just thick stone but warded stone, with layered defensive magics that were purchased at considerable expense from sources that the city government is vague about in official documents and specific about in private. The gates that lead to the Underdark below are built to the same standard: beautiful, functionally indestructible, and capable of being sealed in twelve seconds from any of four control points.\n\n## The Supply Line\n\nPhoenix's Respite runs on a simple calculation: if the Underdark is destabilized, the surface world suffers. If the surface world wants the Underdark stabilized, the surface world pays for it. The city has made itself the indispensable node in this transaction — the place where surface resources are converted into Underdark-compatible goods and moved through the gates. It is genuinely important work. It is also genuinely profitable work, and the city has been careful to ensure that these two things remain aligned.\n\n## What Was Lost\n\nIn the old rubble, below the new foundations, there are things that the rebuilders decided not to excavate. The decision was practical at the time — you build what you need, not what you might find. It has since become something more complicated, as things that were assumed destroyed have turned out to be merely buried. The city has a small department dedicated to determining whether what's down there is salvage or threat. The department's reports are classified. This is widely understood to mean the answer is both.",
  "region": "surface",
  "tags": [
    "location",
    "surface",
    "fortress",
    "supply",
    "hidden"
  ],
  "hidden": true,
  "publishedAt": "2026-02-27T00:00:00.000Z",
  "source": "Lore Import",
  "imageUrl": "https://raw.githubusercontent.com/GamerDad29/mythos-vault/main/images/location-phoenixs-respite.jpg"
}