{
  "id": "location-shadowed-flask",
  "slug": "shadowed-flask",
  "name": "The Shadowed Flask",
  "type": "LOCATION",
  "category": "Underdark Tavern",
  "summary": "Murkhold's most important establishment — where the only rule is that there are no rules that apply to anyone who can afford the drinks.",
  "content": "The Shadowed Flask is built into a natural alcove off Murkhold's main tunnel junction, which means the ceiling is uneven, the corners are dark, and any architect looking at it would have questions. The customers don't have questions. They have the specific appreciation of people who have traveled a long way to be somewhere that will not ask them anything.\n\nThe Flask has been operating for fifty years under three different owners and one consistent policy: privacy is the product. What is said here is not repeated. What is done here is not recorded. What is agreed to here — deals, alliances, contracts that couldn't be made anywhere with witnesses — carries the Flask's informal seal, which in the Underdark carries more practical weight than most governments' official ones. This reputation was established by the first owner, maintained by the second, and protected by the third through means that are not entirely legal and are entirely effective.\n\n## The Rooms\n\nThere are twelve private rooms above the main hall. They are not luxurious — Murkhold is not a luxurious city — but they are private in the fullest sense. The walls are two feet of solid rock. The doors have three locks, two of which the tenant controls. The third lock belongs to the house, and the Flask has never been known to open it uninvited. Whether this is a matter of principle or a matter of business model is a question regulars prefer not to examine.\n\n## The Flask's Proprietor\n\nThe current owner has no name that customers use and doesn't offer one. They are referred to as the Keeper. The Keeper mixes the drinks, manages the rooms, and maintains the policy with the kind of quiet authority that comes from knowing approximately everything about everyone who has ever passed through the door and choosing not to use any of it. The knowing is the power. The not-using is the business.",
  "cityId": "murkhold",
  "region": "underdark",
  "tags": ["location", "underdark", "murkhold", "tavern"],
  "publishedAt": "2026-02-27T00:00:00.000Z",
  "source": "Lore Import"
}
