{
  "id": "location-starhaven",
  "slug": "starhaven",
  "name": "Starhaven",
  "type": "LOCATION",
  "category": "Surface Frontier Town",
  "summary": "Where the road to the Underdark begins — and where everyone who's about to do something dangerous stops to reconsider.",
  "content": "Starhaven sits at the confluence of three trade routes, which is the polite way of saying it sits where three sets of dangerous people need a place to eat, sleep, and resupply before doing whatever they came this far to do. The town exists in service to this function. The inns are good. The merchants are well-stocked with specific categories of equipment. The undertaker is wealthy, discreet, and does not ask about the nature of work that has brought a potential customer to his door.\n\nThe town's name is older than its current incarnation — it comes from the tradition of hanging lanterns in the high tower on clear nights so that travelers approaching across the plain can see a light and know there is shelter ahead. The tradition still holds. What changed is that the travelers now include people coming up from the Underdark as often as people going down, and the light serves as a signal in both directions. The Underdark traders who use it call it the Surface Star. The surface traders call it the Way-Lamp. Neither group knows that the keeper of the tower maintains a record of how many lights appear in response from the deep tunnels below, and sends that record to three different interested parties every month.\n\n## The Caravanserai\n\nThe center of Starhaven's economy is the Caravanserai — a combined market, auction house, and hiring hall where caravans assemble, mercenaries find contracts, and everything needed for serious travel changes hands at premium prices. It is not exploitative in the malicious sense. Frontier prices reflect frontier realities: transport costs, risk premiums, the genuine difficulty of maintaining supply lines to a town this far from any major city. The Caravanserai's operators are aware that their margins are high. They are also aware that their position is irreplaceable, and they price accordingly.\n\n## Departure and Return\n\nStarhaven has a custom: when a group leaves for the Underdark, they leave a token at the Threshold — a carved post at the edge of town, studded with hundreds of small objects, charms, coins, and markers. When they return, they take it back. The post is covered in tokens belonging to people who haven't returned yet. Some of them are recent. Some of them are very old. Nobody removes a token that hasn't been claimed. The post is considered sacred by people who don't use that word.",
  "region": "surface",
  "tags": ["location", "surface", "frontier", "trade", "hidden"],
  "hidden": true,
  "publishedAt": "2026-02-27T00:00:00.000Z",
  "source": "Lore Import"
}
