{
  "id": "monster-stonebond-sentinel",
  "slug": "stonebond-sentinel",
  "name": "Stonebond Sentinel",
  "type": "CREATURE",
  "category": "Medium Construct",
  "summary": "Medium Construct, Lawful Neutral — Challenge 5 (1,800 XP)",
  "content": "> *Medium Construct, Lawful Neutral — Challenge 5 (1,800 XP)*\n\n**STONEBOND SENTINEL**\n\n*The Deepwardens did not build the first Stonebond Sentinels. They found them — sealed behind a basalt door three levels below Hammerhold's oldest ward, standing in rows, waiting. No one alive knows who commissioned them. No inscription bears the craftsman's name. They simply stand, and when the door was opened, they simply resumed.*\n\n**Armor Class** 17 (natural armor) | **Hit Points** 10d8 + 30 (75 HP) | **Speed** 25 ft.\n\n| STR | DEX | CON | INT | WIS | CHA |\n|-----|-----|-----|-----|-----|-----|\n| 20 (+5) | 9 (−1) | 16 (+3) | 10 (+0) | 14 (+2) | 6 (−2) |\n\n**Saving Throws:** Str +7, Con +5\n**Skills:** Athletics +7, Perception +4\n**Damage Immunities:** Poison, Psychic\n**Damage Resistances:** Bludgeoning, Piercing, and Slashing from nonmagical attacks\n**Condition Immunities:** Charmed, Exhaustion, Frightened, Paralyzed, Poisoned\n**Senses:** Darkvision 60 ft., Tremorsense 30 ft., Passive Perception 14\n**Languages:** Understands Dwarvish and Common but does not speak\n\n---\n\n## SPECIAL TRAITS\n\n***Constructed Durability.*** When the Stonebond Sentinel is reduced to 0 hit points but not killed outright, it can make a DC 13 Constitution saving throw. On a success, it is instead reduced to 1 hit point and its Dormant Recharge activates.\n\n***Dormant Recharge.*** Once per long rest, after triggering Constructed Durability, the Sentinel enters a motionless stance until the start of its next turn, then resumes combat at 1 hit point. During this state it is not incapacitated — it is simply conserving.\n\n***Immovable Purpose.*** The Sentinel cannot be moved against its will by any effect of 4th level or lower, including forced movement from shoves, spells, or environmental hazards. Effects of 5th level or higher require the Sentinel to succeed on a DC 14 Strength saving throw to resist displacement.\n\n***Seam-Forged Frame.*** The Sentinel was built from ore drawn from the same geological strata the Deepwardens consider sacred. It has advantage on saving throws against spells and effects originating from extraplanar or undead sources.\n\n***The Patient Eye.*** The Sentinel never makes opportunity attacks out of spite or reflex. Instead, its opportunity attacks deal an additional 1d6 damage. A skilled observer will note it *allows* enemies to disengage — only to follow deliberately.\n\n---\n\n## ACTIONS\n\n***Multiattack.*** The Stonebond Sentinel makes two Forge-Fist attacks. If both attacks hit the same target, the target must succeed on a DC 15 Strength saving throw or be knocked prone.\n\n***Forge-Fist (Melee Weapon Attack).*** *+7 to hit, reach 5 ft., one target.* Hit: 12 (2d6 + 5) bludgeoning damage.\n\n***Sentinel's Press (Recharge 5–6).*** The Stonebond Sentinel advances up to 15 feet in a straight line, moving through the space of any creature Medium or smaller. Each creature whose space it moves through must make a DC 15 Strength saving throw, taking 21 (6d6) bludgeoning damage on a failed save, or half as much on a successful one. Creatures that fail are also pushed 10 feet to either side of the Sentinel's path. This movement does not provoke opportunity attacks.\n\n***Lockdown Grip (Melee Weapon Attack).*** *+7 to hit, reach 5 ft., one target.* Hit: 9 (1d8 + 5) bludgeoning damage and the target is grappled (escape DC 15). While grappled this way, the target is also restrained. The Sentinel can grapple only one creature at a time with this action.\n\n---\n\n## BONUS ACTIONS\n\n***Brace the Line.*** The Sentinel plants itself. Until the start of its next turn, it has advantage on Strength saving throws and all attacks against it made with melee weapons from within 5 feet are made with disadvantage, as it absorbs momentum and closes angles with mechanical precision.\n\n---\n\n## REACTIONS\n\n***Intercept.*** When a creature within 5 feet of the Sentinel targets an ally with a melee attack, the Sentinel may impose disadvantage on that attack roll by interposing its own frame. It takes no damage from this action — it simply steps into the angle of the blow.\n\n---",
  "imageUrl": "https://raw.githubusercontent.com/GamerDad29/mythos-vault/main/images/forge-1772340903923-axgo1g.jpg",
  "tags": [
    "monster",
    "forged",
    "ai-generated"
  ],
  "publishedAt": "2026-03-01T04:55:11.635Z",
  "source": "The Forge"
}