{
  "id": "monster-the-remembrance-heap",
  "slug": "the-remembrance-heap",
  "name": "The Remembrance Heap",
  "type": "CREATURE",
  "category": "Ooze (Shadow-Corrupted)",
  "summary": "Ooze (Shadow-Corrupted) — Challenge 8 (3,900 XP)",
  "content": "> *Ooze (Shadow-Corrupted) — Challenge 8 (3,900 XP)*\n\n**THE REMEMBRANCE HEAP**\n\n*The scholars of the Cerulean Athenaeum called it a theoretical impossibility: a psychic ooze large enough to retain coherent memory fragments from hundreds of absorbed minds simultaneously. They were wrong to theorize and wrong to doubt. The Remembrance Heap is what happens when a Mirror Slick goes unfed for too long and turns — in desperation, in the Plague's cold arithmetic — upon an entire congregation. It wears their recollections like a coat. It knows your name before you say it. It has already seen how this ends.*\n\n**Armor Class** 9 (natural armor) | **Hit Points** 168 (16d10 + 80) | **Speed** 30 ft., climb 30 ft.\n\n| STR | DEX | CON | INT | WIS | CHA |\n|-----|-----|-----|-----|-----|-----|\n| 20 (+5) | 8 (−1) | 20 (+5) | 18 (+4) | 14 (+2) | 8 (−1) |\n\n**Saving Throws:** Con +8, Int +7, Wis +5\n**Skills:** History +7, Insight +5, Perception +5\n**Damage Immunities:** Psychic, Poison\n**Damage Resistances:** Acid; bludgeoning, piercing, and slashing from nonmagical attacks\n**Condition Immunities:** Blinded, charmed, deafened, exhaustion, frightened, prone\n**Senses:** Truesight 30 ft., Blindsight 60 ft. (blind beyond this radius), passive Perception 15\n**Languages:** Understands all languages; communicates only through projected memory-flashes and stolen voices\n\n---\n\n## SPECIAL TRAITS\n\n***Amorphous.*** The Remembrance Heap can move through a space as narrow as 1 inch wide without squeezing.\n\n***Archive of the Consumed.*** The Remembrance Heap retains the surface memories of every creature it has ever absorbed. It has advantage on Insight checks and on saving throws against being deceived. It can speak with a creature's dead loved one's voice as a bonus action (no action required), forcing the listener to succeed on a DC 15 Wisdom saving throw or become frightened of the Heap until the end of that creature's next turn.\n\n***Ioun's Living Database.*** The Remembrance Heap is a priority asset of the Shadow Plague's network. Any spell that would locate, divine upon, or magically detect the Heap — including *Detect Thoughts*, *Scrying*, *True Seeing*, or *Locate Creature* — instead feeds false information to the caster and alerts Ioun's network to the caster's identity and location.\n\n***Plague Resonance.*** Creatures currently infected with the Shadow Plague have disadvantage on saving throws against the Heap's abilities, and the Heap has advantage on attack rolls against them.\n\n***Siege Monster.*** The Remembrance Heap deals double damage to objects and structures. It has absorbed enough architectural memory to understand load-bearing walls.\n\n***Suppressive Aura.*** Any creature that starts its turn within 20 feet of the Remembrance Heap must succeed on a DC 15 Wisdom saving throw or lose access to one of the following (DM's choice) until the start of their next turn: their action, their bonus action, or their reaction, as a stolen memory of paralysis floods their motor function. A creature that succeeds on this saving throw is immune to the Suppressive Aura for 24 hours.\n\n---\n\n## ACTIONS\n\n***Multiattack.*** The Remembrance Heap makes three Pseudopod attacks. It may replace any one of them with a use of Condemned Echo.\n\n***Pseudopod (Melee Weapon Attack).*** *+8 to hit, reach 10 ft., one target.* Hit: 14 (2d8 + 5) bludgeoning damage plus 9 (2d8) acid damage.\n\n***Condemned Echo.*** The Remembrance Heap projects the voice, face, and final memory of a creature it has consumed directly into the mind of one creature it can perceive within 60 feet. The target must succeed on a DC 15 Wisdom saving throw or take 18 (4d8) psychic damage and become incapacitated until the end of their next turn as they relive someone else's death. On a successful save, the target takes half damage and is not incapacitated.\n\n***Engulf.*** The Remembrance Heap moves up to its speed. While doing so, it can enter the spaces of Large or smaller creatures. Any creature whose space it enters must succeed on a DC 16 Strength saving throw or be engulfed. While engulfed, a creature is restrained and unable to breathe, takes 18 (4d8) acid damage at the start of each of the Heap's turns, and must succeed on a DC 15 Wisdom saving throw at the start of each of their turns or take 13 (3d8) psychic damage as the Heap reads them in real time. The engulfed creature can escape by using an action to make a DC 16 Strength check.\n\n***Memory Flood (Recharge 5–6).*** The Remembrance Heap releases a concentrated burst of hundreds of stolen memories in a 30-foot cone. Each creature in the area must succeed on a DC 16 Intelligence saving throw. On a failed save, a creature takes 35 (10d6) psychic damage and is stunned until the end of its next turn. On a successful save, a creature takes half damage and is not stunned. The Heap regains hit points equal to the total psychic damage dealt, divided by the number of creatures affected (minimum 1 creature).\n\n---\n\n## LEGENDARY ACTIONS\n\nThe Remembrance Heap can take 3 legendary actions, choosing from the options below. Only one legendary action option can be used at a time and only at the end of another creature's turn. The Remembrance Heap regains spent legendary actions at the start of its turn.\n\n***Creep (1 Action).*** The Remembrance Heap moves up to half its speed without provoking opportunity attacks.\n\n***Stolen Voice (1 Action).*** The Remembrance Heap speaks in the voice of someone dear to one creature it can perceive within 60 feet, forcing that creature to succeed on a DC 15 Wisdom saving throw or use its reaction to move up to its speed toward the Heap.\n\n***Psychic Lash (2 Actions).*** One creature within 30 feet must succeed on a DC 16 Intelligence saving throw or take 14 (4d6) psychic damage and drop one held item as a memory of powerlessness overwrites their grip reflex.\n\n***Full Absorption (3 Actions).*** The Remembrance Heap targets one engulfed creature. That creature must succeed on a DC 16 Constitution saving throw or drop to 0 hit points as the Heap fast-tracks its consumption. On a successful save, the creature instead takes 28 (8d6) acid damage. If a creature is killed by this action, the Heap immediately regains 30 hit points and permanently retains one of the slain creature's proficiencies or languages.\n\n---",
  "tags": [
    "monster",
    "forged",
    "ai-generated"
  ],
  "publishedAt": "2026-02-25T03:48:02.291Z",
  "source": "The Forge"
}