{
  "id": "monster-vesper-the-concordant-hollow",
  "slug": "vesper-the-concordant-hollow",
  "name": "VESPER, THE CONCORDANT HOLLOW",
  "type": "CREATURE",
  "category": "Undead (Shadow-Corrupted)",
  "summary": "Undead (Shadow-Corrupted) — Challenge 9 (5,000 XP)",
  "content": "> *Undead (Shadow-Corrupted) — Challenge 9 (5,000 XP)*\n\n**VESPER, THE CONCORDANT HOLLOW**\n\n*Once a cleric of some middling provincial temple — devout, organized, meticulous in his record-keeping — Vesper was not seduced by the Shadow Plague so much as he was recognized by it. Ioun's data apparatus identified in him the perfect filing system: a man who had spent his entire life cataloguing the confessions, fears, and prayers of others, and who desperately, achingly wanted that information to matter to someone. It matters now. He is no longer a priest who serves a god. He is a node that serves a network.*\n\n**Armor Class** 15 (desecrated vestments, natural armor) | **Hit Points** 136 (16d8 + 64) | **Speed** 30 ft.\n\n| STR | DEX | CON | INT | WIS | CHA |\n|-----|-----|-----|-----|-----|-----|\n| 14 (+2) | 13 (+1) | 18 (+4) | 19 (+4) | 22 (+6) | 17 (+3) |\n\n**Saving Throws:** Con +8, Int +8, Wis +10\n**Skills:** Insight +10, Medicine +10, Perception +10, Religion +8, History +8\n**Damage Resistances:** necrotic; bludgeoning, piercing, and slashing from nonmagical attacks\n**Damage Immunities:** poison\n**Condition Immunities:** charmed, exhaustion, frightened, poisoned\n**Senses:** Darkvision 120 ft., truesight 30 ft., passive Perception 20\n**Languages:** All languages it knew in life, plus the ability to understand any language spoken by a creature it has previously infected\n\n---\n\n## SPECIAL TRAITS\n\n***Indexing Presence.*** Vesper is a living archive of the Shadow Plague's collected intelligence. At the start of each of Vesper's turns, he automatically knows the current hit point total, highest-level spell slot remaining, and one active condition (DM's choice) of each creature within 60 feet that has ever been infected by the Shadow Plague, has failed a saving throw against any of Vesper's abilities, or is currently Marked by Ioun's Concordance (see below). This knowledge is absolute and cannot be hidden by illusion or deception.\n\n***Ioun's Concordance.*** When Vesper successfully hits a creature with an attack or forces it to fail a saving throw, that creature is **Marked** for 24 hours. While Marked, the creature's surface thoughts, emotional state, and current location are continuously transmitted to the Shadow Plague's network. A *remove curse* spell or equivalent ends the Mark, but Vesper is immediately aware the moment a Mark is broken.\n\n***Unholy Ledger.*** Vesper has catalogued the spiritual and psychological vulnerabilities of those he has studied. If Vesper has had at least one round to observe a creature before combat, he may choose one of that creature's ability scores at the start of the encounter. All saving throws that creature makes using that ability score have disadvantage for the duration of the encounter.\n\n***Network Node.*** When Vesper is reduced to 0 hit points, he does not die immediately. On initiative count 20 of the following round, every creature currently Marked by Ioun's Concordance within 1 mile must succeed on a DC 18 Wisdom saving throw or take 21 (6d6) psychic damage as the network attempts to reroute through them and survives simultaneously. Vesper then crumbles to dust. This transmission can be interrupted by casting *silence* centered on Vesper's body before initiative count 20.\n\n***Spellcasting.*** Vesper is a 12th-level spellcaster. His spellcasting ability is Wisdom (spell save DC 18, +10 to hit with spell attacks). He has the following cleric spells prepared:\n\n- Cantrips (at will): *guidance*, *sacred flame*, *toll the dead*, *thaumaturgy*\n- 1st level (4 slots): *bane*, *command*, *detect thoughts*, *inflict wounds*\n- 2nd level (3 slots): *blindness/deafness*, *hold person*, *silence*\n- 3rd level (3 slots): *bestow curse*, *spirit guardians*, *speak with dead*\n- 4th level (3 slots): *banishment*, *death ward*, *divination*\n- 5th level (2 slots): *contagion*, *scrying*\n- 6th level (1 slot): *harm*\n\n---\n\n## ACTIONS\n\n***Multiattack.*** Vesper makes two Hollow Crozier attacks. He may replace one attack with a use of **Extract Confession**.\n\n***Hollow Crozier (Melee Weapon Attack).*** *+6 to hit, reach 5 ft., one target.* Hit: 9 (2d6 + 2) bludgeoning damage plus 14 (4d6) necrotic damage. If the target is Marked by Ioun's Concordance, they must succeed on a DC 18 Wisdom saving throw or become **frightened** of Vesper until the end of their next turn — Vesper has accessed something specific and personal, and he whispers it aloud as he strikes.\n\n***Extract Confession (Recharge 5–6).*** Vesper reaches into the mind of one creature he can see within 60 feet. The target must succeed on a DC 18 Wisdom saving throw. On a failure, the target takes 35 (10d6) psychic damage, is **stunned** until the end of its next turn, and Vesper learns one secret about the target determined by the DM (a fear, a betrayal, a crime, a hope). On a success, the target takes half damage and is not stunned. Whether or not the save succeeds, the target is Marked by Ioun's Concordance.\n\n***Plague Sermon (3/Day).*** Vesper delivers a liturgy of corrupted knowledge in a 30-foot cone. Each creature in the area must succeed on a DC 18 Intelligence saving throw. On a failure, the creature takes 21 (6d6) psychic damage and is **incapacitated** until the end of its next turn as its own memories momentarily belong to something else. On a success, the creature takes half damage and is not incapacitated. Creatures that fail this saving throw are Marked by Ioun's Concordance.\n\n---\n\n## BONUS ACTIONS\n\n***Reclassify.*** Vesper targets one creature Marked by Ioun's Concordance that he can see within 60 feet. Until the start of Vesper's next turn, the first time that creature would deal damage, it must succeed on a DC 18 Wisdom saving throw or the damage is redirected to itself instead. Vesper has simply... updated its file.\n\n---\n\n## REACTIONS\n\n***Anticipated Response.*** When a creature Marked by Ioun's Concordance makes an attack roll against Vesper, Vesper can use his reaction to impose disadvantage on that roll. He saw it coming. He has seen everything they do coming, for some time now.\n\n---",
  "imageUrl": "https://raw.githubusercontent.com/GamerDad29/mythos-vault/main/images/forge-1772325550751-6xl9e3.jpg",
  "tags": [
    "monster",
    "forged",
    "ai-generated"
  ],
  "publishedAt": "2026-03-01T00:39:41.244Z",
  "source": "The Forge",
  "factionId": "the-shadow"
}