{
  "id": "city-murkhold",
  "slug": "murkhold",
  "name": "Murkhold",
  "type": "CITY",
  "category": "Underdark Waystation",
  "summary": "It exists because someone needed it to exist. Nobody's proud of it. Everybody uses it.",
  "content": "Murkhold is what you get when a crossroads becomes a settlement and a settlement becomes a problem. The tunnels that converge here have been used since before anyone bothered writing down who used them, and the camp that grew up to service travelers has been here so long that calling it a camp stopped making sense two hundred years ago. At some point it became a town. Nobody signed anything. Nobody declared anything. One day there were enough permanent residents that the concept of a permanent resident had meaning, and Murkhold existed.\n\nThe city's name comes from the Murk — a stretch of cavern just west of the central junction where the tunnel ceilings drop to eight feet and the ground fog from underground springs comes up to your waist. Travelers pass through the Murk quickly if they know the route and cautiously if they don't. A few of them stop. The ones who stop tend to stay. Murkhold has that quality — not that it's attractive, but that it's easier to stay than to figure out where else to go.\n\n## Government, Such As It Is\n\nMurkhold has a Holdmaster, a title that sounds more impressive than it functions. The current Holdmaster is a gnome of indeterminate age named Pell who has held the position for thirty years and who describes their job as \"making sure the important arguments don't become violent and the violent arguments don't become permanent.\" They are good at this. The city runs because the city needs to run — trade, passage fees, the Shadowed Flask — and because Pell has thirty years of knowing who owes what to whom and when to remind them of it.\n\n## The Shadowed Flask\n\nThe Shadowed Flask is Murkhold's most notable establishment and the reason most travelers stop at all — an inn and tavern built into a natural alcove off the main tunnel, with rooms that are private, drinks that are strong, and a policy of not asking questions that has been in place since its founding. What happens in the Flask stays in the Flask. This is not a promise. It is a business model that has worked for fifty years, and Pell has killed exactly two people for violating it. The Flask's current proprietor keeps a commemorative plaque.",
  "imageUrl": null,
  "tags": ["city", "underdark", "murkhold", "waystation"],
  "region": "underdark",
  "publishedAt": "2026-02-27T00:00:00.000Z",
  "source": "Lore Import",
  "meta": {
    "accentColor": "#4A6B50",
    "heroSubtitle": "The Underdark · Waystation",
    "heroTagline": "The Holdfast",
    "heroMotto": "\"Don't ask. Don't tell. Don't start trouble you can't finish.\""
  }
}
