{
  "id": "city-vragathul",
  "slug": "vragathul",
  "name": "Vragathul",
  "type": "CITY",
  "category": "Underdark Metropolis",
  "summary": "Half a million souls beneath the stone, and the politics to match — Vragathul is the Underdark at full scale, with all the beauty and horror that implies.",
  "content": "Vragathul doesn't have a founding myth. It has a census. The Underdark's largest city grew not from conquest or vision but from accumulation — of people, of resources, of debts unpaid and grudges unresolved and opportunities that nowhere else would take. There is a theory, popular among scholars and deeply unpopular among Vragathul's ruling bodies, that the city became powerful by accident and will end the same way. The scholars are probably right. The ruling bodies have excellent memory for names.\n\nThe scale of Vragathul is genuinely difficult to hold in the mind. The cavern system it occupies is fourteen kilometers at its widest, lit by a combination of bioluminescent fungi, elemental light cores, and the reflected glow of three volcanic vents that the city has been building toward and away from simultaneously for two hundred years. The upper districts are almost comfortable. The lower districts are the Underdark as the Underdark was always meant to be — dark, close, and populated by things that have given up on comfort in exchange for capability.\n\n## The Triumvirate\n\nVragathul is governed by a Triumvirate of three families who have been at each other's throats for so long that they've developed a kind of intimacy about it. The Vreth family controls the surface transit routes. House Kalzar controls the deep tunnels. The Merchant Collective controls everything in between. Every decision of significance requires two of three to agree, which means that every decision of significance has a price, and the third party sets it. It is a system perfectly designed for stability and perfectly designed to be gamed, and Vragathul's history is the record of both happening simultaneously.\n\n## What Makes Vragathul Dangerous\n\nNot any one thing. That's the answer. Other cities have a specific threat — the war-mechs, the debt market, the gem trade with teeth. Vragathul's danger is ambient. It's the danger of size: of being in a place where something always needs doing, someone always needs something from you, and the city is large enough that your disappearance wouldn't be noticed for weeks.",
  "imageUrl": "https://raw.githubusercontent.com/GamerDad29/mythos-vault/main/images/city-vragathul.jpg",
  "tags": [
    "city",
    "underdark",
    "vragathul",
    "metropolis"
  ],
  "region": "underdark",
  "publishedAt": "2026-02-27T00:00:00.000Z",
  "source": "Lore Import",
  "meta": {
    "accentColor": "#8B3030",
    "heroSubtitle": "The Underdark · Metropolis",
    "heroTagline": "The Underground Metropolis",
    "heroMotto": "\"Big enough to lose yourself. Small enough that the wrong people find you.\""
  }
}